```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_environments_repository.github_actions_secret.repository_secret["GPG_PASSWORD"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "GPG_PASSWORD"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_actions_secret.repository_secret["GPG_PRIVATE_KEY"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_actions_secret.repository_secret["SLACK_WEBHOOK"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_actions_secret.repository_secret["SONATYPE_PASSWORD"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "SONATYPE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_actions_secret.repository_secret["SONATYPE_USERNAME"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "SONATYPE_USERNAME"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_actions_secret.repository_secret["WORKFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "repository_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "dp-terraform-github-environments"
      + secret_name     = "WORKFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github_environments_repository.github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "dp-terraform-github-environments"
    }

  # module.github_environments_repository.github_branch_protection_v3.branch_protection will be created
  + resource "github_branch_protection_v3" "branch_protection" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "dp-terraform-github-environments"
      + require_conversation_resolution = false
      + require_signed_commits          = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + checks = [
              + "test:test",
            ]
          + strict = true
        }
    }

  # module.github_environments_repository.github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Scala"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dp-terraform-github-environments"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_environments_repository.github_team_repository.team_repository will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "dp-terraform-github-environments"
      + team_id    = "digital-records-infrastructure"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```